app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("task", "date", "time", "priority", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["task", "1234"], ["date", "12/25/1997"], ["time", 45], ["priority", 1], ["created_at", 2017-04-11 03:47:17 UTC], ["updated_at", 2017-04-11 03:47:17 UTC]]