app/controllers/list_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @todos = Item.all